БухЭксп/Catalogs/CW_ВидыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ВидыКонтактнойИнформации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипКИ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_ВидыКонтактнойИнформации/Forms/ФормаВыбора/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// формируем список типов контактной информации
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	CW_ВидыКонтактнойИнформации.ТипКИ КАК ТипКИ
	               |ИЗ
	               |	Справочник.CW_ВидыКонтактнойИнформации КАК CW_ВидыКонтактнойИнформации
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ТипКИ";
	ТЗ_ТКИ = Запрос.Выполнить().Выгрузить();
	Для каждого Стр Из ТЗ_ТКИ Цикл
		
		Нстр = ТипыКИ.Добавить();
		Нстр.Ссылка = Стр.ТипКИ;
		Нстр.АдресКартинки = Стр.ТипКИ.СсылкаКартинки;
		
	КонецЦикла; 
	
	Если (ЗначениеЗаполнено(Параметры.ТекущаяСтрока)) Тогда
		
		ТекущийВид = Параметры.ТекущаяСтрока;
		ТекущийТип = ТекущийВид.ТипКИ;
		// --- 
		СтрокаТипа = _сф.к_НайтиСтроку(ТипыКИ,Новый Структура("Ссылка",ТекущийТип));
		Элементы.ТипыКИ.ТекущаяСтрока = СтрокаТипа.ПолучитьИдентификатор();
		// --- 
		Элементы.Список.ТекущаяСтрока = ТекущийВид;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ТипыКИПриАктивизацииСтроки(Элемент)
	
	Если (Элементы.ТипыКИ.ТекущиеДанные <> Неопределено) Тогда
		_ОтборВидовКИ(Элементы.ТипыКИ.ТекущиеДанные.Ссылка);	
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура _ОтборВидовКИ(ТипКИ)
	// --- 
	
	Список.Отбор.Элементы.Очистить();
	_УФС.ДобавитьОтбор(Список.Отбор,"ТипКИ",,ТипКИ);
	
	// --- 
КонецПроцедуры


&НаКлиенте
Процедура ТипыКИВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	// --- 
	Ответ = _ПолучитьОсновнойВидТипа(Элементы.ТипыКИ.ТекущиеДанные.Ссылка);
	Если (Ответ <> Неопределено) Тогда
		ОповеститьОВыборе(Ответ);
	КонецЕсли; 
	
КонецПроцедуры
 
&НаСервере
Функция _ПолучитьОсновнойВидТипа(ТипКИ)
	// --- 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	CW_ВидыКонтактнойИнформации.Ссылка
	               |ИЗ
	               |	Справочник.CW_ВидыКонтактнойИнформации КАК CW_ВидыКонтактнойИнформации
	               |ГДЕ
	               |	CW_ВидыКонтактнойИнформации.Основной = ИСТИНА
	               |	И CW_ВидыКонтактнойИнформации.ТипКИ = &ТипКИ
	               |	И CW_ВидыКонтактнойИнформации.ПометкаУдаления = ЛОЖЬ";
	ОсновнойВидКИ = _сф.ВыполнитьЗапрос(Запрос,Новый Структура("ТипКИ",ТипКИ),Истина,"Ссылка",Неопределено);
	// --- 
	Возврат(ОсновнойВидКИ);
	
	// --- 
КонецФункции
